examples/of2206/kOmegaSST/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{

    inlet
    {
        type            EpsilonABL;
        #include        "include/ABLConditions"
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }

   
    // ground
    // {
    // type            atmEpsilonWallFunction;
    // #include        "include/ABLConditions"
    // z0              uniform $z0;
    // E               9.793;
    // value           $internalField;
    // }

    // ground
    // {
    //     type            epsilonWallFunction;
    //     Cmu             0.09;
    //     kappa           0.4;
    //     E               9.8;
    //     value           $internalField;
    // }

    ground
    {
        type            epsilonRoughABL;
        #include        "include/ABLConditions"

        z0              uniform $z0;
        ustar           uniform $ustar;
        kappaWF         uniform $kappaWF;
        
        A               uniform $A;
        B               uniform $B;
        C               uniform $C;
        D               uniform $D;
        Etke            uniform $E;

        WFCmu           uniform $WFCmu;
        CmuMax          uniform $CmuMax;
        blendCoeff      uniform $blendCoeff;
        zDir            uniform $zDir;
        roughWall       uniform $roughWall;

        thresholdU      uniform $thresholdU;
        thresholdE      uniform $thresholdE;
        thresholdK      uniform $thresholdK;
        thresholdO      uniform $thresholdO;

        constantU       uniform $constantU;
        constantE       uniform $constantE;
        constantK       uniform $constantK;
        constantO       uniform $constantO;

        value           $internalField;
    }

    building
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }

    surroundings
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }

    #include "include/sideAndTopPatches"

    top
    {
        type fixedValue;

        #include        "include/ABLConditions"
        #include        "../system/blockMeshDict"

        topEps #calc    "(pow($ustar,3) / ($kappa * ($zMax+$z0)))";
       
        value uniform $topEps;
    }   

}


// ************************************************************************* //
